tap "oven-sh/bun"
brew "fzf"
brew "gh"
brew "git-delta"
brew "jq"
brew "node"
brew "pnpm"
brew "python@3.14"
brew "ripgrep"
brew "tlrc"
brew "uv"
brew "zsh"
brew "terminal-notifier"
brew "oven-sh/bun/bun"
cask "claude-code"
vscode "anthropic.claude-code"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "james-yu.latex-workshop"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vsliveshare.vsliveshare"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "swiftlang.swift-vscode"
vscode "vue.volar"
